In [1]:
import pandas as pd

### Manipulation of dataframe : how to add rows in it.

In [2]:
# List of Tuples
students = [ ('jack', 34, 'Sydeny' , 'Australia') ,
             ('Riti', 30, 'Delhi' , 'India' ) ,
             ('Vikas', 31, 'Mumbai' , 'India' ) ,
             ('Neelu', 32, 'Bangalore' , 'India' ) ,
             ('John', 16, 'New York' , 'US') ,
             ('Mike', 17, 'las vegas' , 'US')  ]

In [3]:
students

[('jack', 34, 'Sydeny', 'Australia'),
 ('Riti', 30, 'Delhi', 'India'),
 ('Vikas', 31, 'Mumbai', 'India'),
 ('Neelu', 32, 'Bangalore', 'India'),
 ('John', 16, 'New York', 'US'),
 ('Mike', 17, 'las vegas', 'US')]

In [4]:
# Now, Create a DataFrame object
df = pd.DataFrame(students, columns = ['Name' , 'Age', 'City' , 'Country'], index=['a', 'b', 'c' , 'd' , 'e' , 'f']) 
df

    Name  Age       City    Country
a   jack   34     Sydeny  Australia
b   Riti   30      Delhi      India
c  Vikas   31     Mumbai      India
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US

### Using DataFrame.append() and Dictionary

In [5]:
df.head(2)

   Name  Age    City    Country
a  jack   34  Sydeny  Australia
b  Riti   30   Delhi      India

In [6]:
# Pass the row elements as key value pairs to append() function 
modDfObj = df.append({'Name' : 'Sunil' , 'Age' : 22} )
modDfObj

C:\Users\abhis\AppData\Local\Temp\ipykernel_13240\948662361.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  modDfObj = df.append({'Name' : 'Sunil' , 'Age' : 22} )

TypeError: Can only append a dict if ignore_index=True

In [ ]:
# we had above error because, we havent supplied ingore_index=True, as we are not giving a dictionary format
modDfObj = df.append({'Name' : 'Sunil' , 'Age' : 22}, ignore_index=True)
modDfObj

In [ ]:
modDfObj = df.append({'Name' : 'Sunil' , 'Age' : 22,'pincode':123456} , ignore_index=True)
modDfObj

### dataframe.append() and Series

In [ ]:
s = pd.Series(['Raju', 21, 'Bangalore', 'India'],index=['Name','Age','City','Country'] )
s

In [ ]:
df.append(s)

In [ ]:
# Pass a series in append() to append a row in dataframe  ---#df.columns
modDfObj = df.append(s, ignore_index=True)
modDfObj

In [ ]:
r = pd.Series(['Rohit',23,'Paris','US'])
r

In [ ]:
df.append(r,ignore_index=True)

In [ ]:
r = pd.Series(['Rohit',23,'Paris','US'],index=['Name','Age','City','Country'])
r

In [ ]:
df.append(r,ignore_index=True)

### Now, lets try to add multiple rows.

In [ ]:
df.columns

In [ ]:
pd.Series(['Raju', 21, 'Bangalore', 'India'],index=df.columns)#['Name']

In [ ]:
# lets give List of series  
listOfSeries = [pd.Series(['Raju', 21, 'Bangalore', 'India'], index=df.columns ) ,
                pd.Series(['Sam', 22, 'Tokyo', 'Japan'], index=df.columns ) ,
                pd.Series(['Rocky', 23, 'Las Vegas', 'US'], index=df.columns ) ]
listOfSeries

In [ ]:
# Pass a list of series to the append() to add multiple rows
modDfObj = df.append(listOfSeries)
modDfObj
# here if we check index, then its not in proper order

In [ ]:
# For that fault, use ignore_index =True to scale index
modDfObj = df.append(listOfSeries , ignore_index=True)
modDfObj

### Now, lets add row from one DataFrame to another DataFrame

In [ ]:
# List of Tuples
students = [ ('Rahul', 22, 'Sydeny' , 'Australia') ,
             ('Parul', 23, 'Pune' , 'India')  ]
#Create a DataFrame object
df2 = pd.DataFrame(students, columns = df.columns, index=['a', 'b']) 
df2

In [ ]:
df

In [ ]:
modDfobj = df.append(df2, ignore_index=True)
modDfobj

In [ ]:
df2

In [ ]:
# See the label based selection
df2.loc['b'] #[rows,columns]

In [ ]:
# Now, lets add row at index b from dataframe df2 to dataframe modDfObj
modDfobj = df.append(df2.loc['b'], ignore_index=True)
modDfobj

## now, without using append() how to add rows into our DataFrame?

In [ ]:
df

In [ ]:
# Add a new row at index k with values provided in list
df.loc['k'] = ['Smriti', 26, 'Bangalore', 'India']
df

In [ ]:
#if index is already present, in df
#if we want to add new data,then it will overwrite data
df.loc['e'] = ['Pravin', 26, 'Pune', 'India']
df

In [ ]:
df.loc['e']

In [ ]:
#Assignment: I want to add entries/rows in between the present data frame
# NOTE: I dont want to overwrite data

In [ ]:
df

### Addition of columns

In [ ]:
df = df[:7]

In [ ]:
df

In [ ]:
df.shape

In [ ]:
# to add column use df[column_name] = [values]
df['Number']=[1,2,3,4,5,7,8]
df

In [ ]:
import numpy as np
np.random.random(7)

In [ ]:
df['random'] = np.random.random(7)
df

In [ ]:
df.loc[:,['New_col']] = [10,20,30,40,50,60,70]
df

In [ ]:
# how to replace old values with new one
df.Number

In [ ]:
list(range(101,108))

In [ ]:
df.Number = range(101,108)
df

In [ ]:
#lets change any of the values present in df
df.Name['a'] = 'Pooja'
df

In [ ]:
df['Age']

In [ ]:
#replace first 3 age records by 25,26,27
df.Age['a':'c'] = [25,26,27]
# in slicing with Series , Stop is inclusive
df

In [7]:
#Assignment:
# How to add column in between the dataFrame
# Replace Smriti as Snehal
# Replace Bangalore by Maysor

In [10]:
df.drop(index='a')

    Name  Age       City Country
b   Riti   30      Delhi   India
c  Vikas   31     Mumbai   India
d  Neelu   32  Bangalore   India
e   John   16   New York      US
f   Mike   17  las vegas      US

In [11]:
df.drop(index=['a','b','c'])

    Name  Age       City Country
d  Neelu   32  Bangalore   India
e   John   16   New York      US
f   Mike   17  las vegas      US

In [13]:
df.drop(columns=['City','Age'])

    Name    Country
a   jack  Australia
b   Riti      India
c  Vikas      India
d  Neelu      India
e   John         US
f   Mike         US

In [14]:
df

    Name  Age       City    Country
a   jack   34     Sydeny  Australia
b   Riti   30      Delhi      India
c  Vikas   31     Mumbai      India
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US

In [15]:
d = pd.DataFrame([[1,1],[1,1],[1,1]],columns=['A','A'])
d

   A  A
0  1  1
1  1  1
2  1  1

In [16]:
d.loc[:,~d.columns.duplicated()]

   A
0  1
1  1
2  1

In [17]:
d.columns.duplicated()

array([False,  True])